---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Profile Methods
Profile Class See Also Send Feedback
---

The Profile type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of this profile. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
|  | Equals | Determines whether the specified Object is equal to the current Object.  (Inherited from GeometryObject.) |
|  | GetHashCode | Gets the integer value of the geometry object as hash code  (Inherited from GeometryObject.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

Profile Class

Autodesk.Revit.DB Namespace